Revit 2027 API
BuiltInFailures.NumberingFailures Class
 Failures related to object numbering operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.NumberingFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class NumberingFailures
Public NotInheritable Class NumberingFailures
public ref class NumberingFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type NumberingFailures = class end
The BuiltInFailures.NumberingFailures type exposes the following members.
Properties
Name | Description
InputOutOfValidRangeError |  The input value is out of the allowed range.
MoreThenOneElementWasChanged |  The operation lead to the renumbering of more then one element.
NumberAlreadyInUseError |  The new number is already in use.
SampleNumberingError |  Replace this with the first real one
Top
See Also
Reference
Autodesk.Revit.DB Namespace